dict = {
    "A":{
        "部门":"科技部",
        "工资":3000,
        "级别":1
    },
    "B":{
        "部门":"市场部",
        "工资":5000,
        "级别":2
    },
    "C":{
        "部门":"销售部",
        "工资":7000,
        "级别":3
    },
    "D":{
        "部门":"财务部",
        "工资":8000,
        "级别":1
    },
    "E":{
        "部门":"人事部",
        "工资":9000,
        "级别":2
    }
}
print(f"全体员工信息如下：\n{dict}")
for key in dict:
    if dict[key]["级别"] == 1:
        dict[key]["级别"] += 1
        dict[key]["工资"] += 1000

print(f"经过调整后员工信息如下：\n{dict}")